/*
11. Написать программу, которая по введенному числу от 1 до 12 (номеру месяца) выдает все приходящиеся на этот месяц праздничные дни(например, если введено число 1, то должно получиться 1 января — Новый год, 7 января — Рождество).
*/
#include <iostream>
#include <Windows.h>;
using namespace std;

int main()
{
	SetConsoleOutputCP(1251);
	int a;
	cout << "Святкові та вихідні дні в Україні 2020\n";
	cout << "Оберіть місяць:";
	cin >> a;
	switch (a) {
	case 1:cout << "1 січня — Новий рік\n7 січня — Різдво";	break;
	case 2:cout << "Святкові та вихідні дні відсутні"; break;
	case 3:cout << "8 березня — Міжнародний жіночий день"; break;
	case 4:cout << "19 квітня — Великдень"; break;
	case 5:cout << "1 травня — День праці\n9 травня — День перемоги над нацизмом в Другій світовій війні (День перемоги)"; break;
	case 6:cout << "7 червня — Трійця\n28 червня — День Конституції України"; break;
	case 7:cout << "Святкові та вихідні дні відсутні"; break;
	case 8:cout << "24 серпня — День незалежності України"; break;
	case 9:cout << "Святкові та вихідні дні відсутні"; break;
	case 10:cout << "14 жовтня — День захисника України"; break;
	case 11:cout << "Святкові та вихідні дні відсутні"; break;
	case 12:cout << "25 грудня — Католицьке Різдво"; break;
	default: cout << "Ошибка";
	}
	return 0;
}
